<?php

namespace Database\Seeders;

use App\Models\Factor;
use App\Models\Question;
use Illuminate\Database\Seeder;
use App\Models\FactorExplanationConfig;

class FactorExplanationConfigPersianSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //Forward/Backward Questions
        $factorExplanations = [
            // persian
            
            [
                'factor' => 'Time',
                'language' => 'fa',
                'name'=> 'فاکتور (Ti) آگاهی زمانی (تمام وقت دنیا)',
                'score_label'=> 'زمان',
                'high_score'=> '<strong>امتیاز بالا</strong> نشان می‌دهد که شما برای ایجاد بهبود در زندگی‌تان در هر سنی باز هستید، زیرا گذر زمان را به‌عنوان محدودیتی برای تغییرات مثبت نمی‌بینید.',
                'low_score'=> '<strong>امتیاز پایین</strong> نشان می‌دهد که شما در حال پیوند دادن افزایش سن به محدود شدن گزینه‌های تغییرات مثبت در زندگی‌تان هستید. ممکن است بیش از حد به آنچه فرهنگ به شما در مورد گذر زمان آموخته است، توجه کرده باشید.',
                'high_score_suggestion'=> '<strong>پیشنهادها=></strong> اجازه ندهید دیگران ذهنیت مثبت شما را دلسرد کنند. به دنبال حمایت اجتماعی با نگرش‌های مشابه باشید. این که احساس کنید تمام وقت دنیا در اختیار دارید، یک عامل قدرتمند برای آگاهی کهنه‌سالی است که مرتبط با رشد سالم با افزایش سن می‌باشد. در افسانه فرهنگی که گذر زمان باعث تحلیل ذهنی و جسمی می‌شود، گرفتار نشوید.',
                'low_score_suggestion'=> '<strong>پیشنهادها=></strong> بپذیرید که مستقل از سن‌تان، اکنون هیچ‌گاه برای انجام تعهدات و تغییرات مثبت دیر نیست. چیزی که بیش‌تر اهمیت دارد، آن چیزی است که با زمان انجام می‌دهید، در هر سنی. کنجکاوی ادراک زمان را گسترش می‌دهد، در حالی که بی‌علاقگی ادراک زمان را کوتاه می‌کند. ادراک زمان، بیش‌تر از زمان واقعی، بر بیولوژی پیری تأثیر دارد.',
                'created_at'=> date('Y-m-d H:i:s'),
                'personal_profile_summary' => 'علاوه بر نتایج هر یک از ۸ فاکتور، رتبه‌بندی شما بر اساس سن‌تان و پیشنهادهای ما، در اینجا خواهید دید رتبه‌ای که بر اساس نمره کل شما در هر فاکتور تعیین شده است. تغییراتی را در مسیر جدید آگاهی کهنه‌سالی خود پرورش دهید.'
            ],
            [
                'factor' => 'Self Valuation',
                'language' => 'fa',
                'name'=> 'فاکتور (Sv) آگاهی خود-ارزش‌گذاری (جست‌وجو برای تعالی شخصی)',
                'score_label'=> 'خود-ارزش‌گذاری',
                'high_score'=> '<strong>امتیاز بالا</strong> نشان می‌دهد که شما با اعتمادبه‌نفس خود را ارزش می‌دهید. این ادراک از معنا و ارزش خود در مقابل غفلت از خود، عاملی در آگاهی کهنه‌سالی مرتبط با رشد سالم‌تر با افزایش سن است.',
                'low_score'=> '<strong>امتیاز پایین</strong> نشان می‌دهد که شما ارزش خود را بیشتر در دیگران می‌گذارید تا خود. فرهنگ‌ها به ما می‌آموزند که اگر به نیازهای خود اولویت دهیم یا بدون تواضع کاذب ستایش شویم، احساسات منفی داشته­‌باشیم.',
                'high_score_suggestion'=> '<strong>پیشنهادها=></strong> اجازه ندهید دیگران ذهنیت مثبت شما را دلسرد کنند. به دنبال حمایت اجتماعی با نگرش‌های مشابه باشید. ستایش را بدون عذرخواهی یا کم‌کردن استعدادهای طبیعی‌تان بپذیرید.',
                'low_score_suggestion'=> '<strong>پیشنهادها=></strong> یاد بگیرید با دیگران حدّ سالمی تعیین کنید و به آن‌ها اجازه دهید از تعهدات جدید خود ناراضی باشند. به واکنش‌تان وقتی ستایش می‌شوید توجه کنید تا تشخیص دهید که چه فرهنگ‌هایی به شما آموخته‌اند «تواضع کاذب». پذیرفتن تعالی‌تان با وقار، کمک به پرورش آگاهی کهنه‌سالی مرتبط با رشد سالم‌تر با افزایش سن است.',
                'created_at'=> date('Y-m-d H:i:s'),
                'personal_profile_summary' => 'علاوه بر نتایج هر یک از ۸ فاکتور، رتبه‌بندی شما بر اساس سن‌تان و پیشنهادهای ما، در اینجا خواهید دید رتبه‌ای که بر اساس نمره کل شما در هر فاکتور تعیین شده است. تغییراتی را در مسیر جدید آگاهی کهنه‌سالی خود پرورش دهید.'
            ],
            [
                'factor' => 'Aging',
                'language' => 'fa',
                'name'=> 'فاکتور (Ag) آگاهی پیر شدن (مسیر بهبود سلامت در فرایند پیر شدن)',
                'score_label'=> 'پیری',
                'high_score'=> '<strong>امتیاز بالا</strong> نشان می‌دهد که درک مثبتی از این دارید که فرهنگ شما، بیش‌تر از ژنتیک‌تان، بر فرایند پیر شدن تأثیر دارد. باور اینکه اقدامات شما می‌توانند بیولوژی پیری را تحت‌تأثیر قرار دهند، یکی از عوامل قدرتمند در آگاهی کهنه‌سالی است.',
                'low_score'=> '<strong>امتیاز پایین</strong> نشان می‌دهد که شما بیش‌تر بر ژنتیک (سن تقویمی) تأکید دارید تا ظاهر و عملکردتان (سن بیولوژیک).',
                'high_score_suggestion'=> '<strong>پیشنهادها=></strong> اجازه ندهید دیگران ذهنیت مثبت شما را دلسرد کنند. به دنبال پیوندهای اجتماعی با نگرش‌های مشابه باشید. آیین‌ها و باورهای فرهنگی را اتخاذ کنید که از طول عمر سالم پشتیبانی می‌کنند. برای انتخاب مسیر سلامت‌تان منتظر اجازه دیگران نباشید. برخی افراد حتی اگر زندگیشان زیان‌آور باشد، حاضر به تغییر نیستند.',
                'low_score_suggestion'=> '<strong>پیشنهادها=></strong> افرادی را که سن‌شان بالاتر از شماست اما جوان‌تر به نظر می‌آیند، مشاهده کنید و ببینید چگونه زندگی می‌کنند. بسیاری از کهنه‌سالان ما، پیر شدن را فرصتی برای کشف راه‌های جدید عشق‌ورزی به خود و دیگران می‌دانند. افزایش این فاکتور، آگاهی کهنه‌سالی مرتبط با رشد سالم‌تر در هر سنی را تقویت می‌کند.',
                'created_at'=> date('Y-m-d H:i:s'),
                'personal_profile_summary' => 'علاوه بر نتایج هر یک از ۸ فاکتور، رتبه‌بندی شما بر اساس سن‌تان و پیشنهادهای ما، در اینجا خواهید دید رتبه‌ای که بر اساس نمره کل شما در هر فاکتور تعیین شده است. تغییراتی را در مسیر جدید آگاهی کهنه‌سالی خود پرورش دهید.'
            ],
            [
                'factor' => 'Health',
                'language' => 'fa',
                'name'=> 'فاکتور (He) آگاهی سلامت (کشف علل سلامت)',
                'score_label'=> 'سلامت',
                'high_score'=> '<strong>امتیاز بالا</strong> نشان می‌دهد که شما درک مثبتی از این دارید که بیماری‌های خانوادگی فقط زمینه هستند، نه حکم ژنتیکی قطعی. این ادراک مثبت از سلامت، عاملی در آگاهی کهنه‌سالی مرتبط با رشد سالم‌تر با افزایش سن است. تمرکز بر مدت سلامت به جای مدت زندگی.',
                'low_score'=> '<strong>امتیاز پایین</strong> نشان می‌دهد که شما درک نمی‌کنید تا چه حد بر بهبود سلامت‌تان تأثیر دارید. شما می‌توانید از احساس کنترل بیرونی به کنترل درونی سلامت خود منتقل شوید. کشف اینکه چه بخش‌هایی از ظرفیت بدن‌تان برای بهبود مسدود شده‌اند، به پرورش آگاهی کهنه‌سالی کمک می‌کند.',
                'high_score_suggestion'=> '<strong>پیشنهادها=></strong> اجازه ندهید دیگران ذهنیت مثبت شما را دلسرد کنند. به دنبال حمایت اجتماعی با نگرش‌های مشابه باشید. به دنبال علل به‌زیستی باشید نه بی‌قدرتی که سلامت را به‌عنوان چیزی در حال کاهش می‌بیند.',
                'low_score_suggestion'=> '<strong>پیشنهادها=></strong> به اعضای خانواده‌تان توجه کنید که بیماری‌های منتظره را تجربه نکرده‌اند و کشف کنید چگونه باورها و سبک زندگی‌شان متفاوت است. به تدریج آنچه با آن‌ها یاد می‌گیرید را در زندگی‌تان بگنجانید. ژنتیک فقط ۲۰٪ از طول عمر را تأمین می‌کند. متعهد شوید که کشف کنید چگونه ممکن است در مسیر درمان‌تان مانع گذاشته باشید. هرگز خودتان را به‌خاطر بیماری‌تان سرزنش نکنید. به جای آن، به روش‌هایی برای ارتقای کمک شخصی و حرفه‌ای‌تان در فرایند بهبود فکر کنید.',
                'created_at'=> date('Y-m-d H:i:s'),
                'personal_profile_summary' => 'علاوه بر نتایج هر یک از ۸ فاکتور، رتبه‌بندی شما بر اساس سن‌تان و پیشنهادهای ما، در اینجا خواهید دید رتبه‌ای که بر اساس نمره کل شما در هر فاکتور تعیین شده است. تغییراتی را در مسیر جدید آگاهی کهنه‌سالی خود پرورش دهید.'
            ],
            [
                'factor' => 'Curiosity',
                'language' => 'fa',
                'name'=> 'فاکتور (Cu) آگاهی کنجکاوی (پرسشگری درباره خود و دیگران)',
                'score_label'=> 'کنجکاوی',
                'high_score'=> '<strong>امتیاز بالا</strong> نشان می‌دهد که شما به‌راحتی از کشف، تازگی و یادگیری جدید در کل زندگی لذت می‌برید.',
                'low_score'=> '<strong>امتیاز پایین</strong> نشان می‌دهد که شما تمایلی به یادگیری نو و تازگی در زندگی ندارید.',
                'high_score_suggestion'=> '<strong>پیشنهادها=></strong> به دنبال راه‌های خلاقانه برای تغییر آنچه ممکن است در کار یا زندگی‌تان خسته‌کننده یا ناخوشایند باشد، باشید.',
                'low_score_suggestion'=> '<strong>پیشنهادها=></strong> شروع کنید به جست‌وجوی راه‌های خلاق برای دیدن زندگی و تغییرات مثبت اطراف‌تان. به تدریج یادگیری جدید را در کار و روابط‌تان بپذیرید.',
                'created_at'=> date('Y-m-d H:i:s'),
                'personal_profile_summary' => 'علاوه بر نتایج هر یک از ۸ فاکتور، رتبه‌بندی شما بر اساس سن‌تان و پیشنهادهای ما، در اینجا خواهید دید رتبه‌ای که بر اساس نمره کل شما در هر فاکتور تعیین شده است. تغییراتی را در مسیر جدید آگاهی کهنه‌سالی خود پرورش دهید.'
            ],
            [
                'factor' => 'Gratitude',
                'language' => 'fa',
                'name'=> 'فاکتور (Gr) آگاهی شکرگزاری (پذیرش با وقار از خود و دیگران)',
                'score_label'=> 'شکرگزاری',
                'high_score'=> '<strong>امتیاز بالا</strong> نشان می‌دهد که شما قادر به پذیرش واقعی خوش‌بختی، ستایش و هدایای دیگران بدون احساس تکلیف برای جبران هستید.',
                'low_score'=> '<strong>امتیاز پایین</strong> نشان می‌دهد که شما در پذیرش هدایای دیگران یا ستایش شدن دچار مشکل هستید؛ ممکن است لازم بدانید ستایش یا هدایای دیگران را کم‌اهمیت جلوه دهید.',
                'high_score_suggestion'=> '<strong>پیشنهادها=></strong> به توسعهٔ پذیرش ذاتی ارزش خود و دریافت از کسانی که شما را ارج می‌نهند، ادامه دهید. ارزش دادن بیش‌ازحد به کاری که برای دیگران انجام می‌دهید، ظرفیت شما برای شکرگزاری را کاهش می‌دهد.',
                'low_score_suggestion'=> '<strong>پیشنهادها=></strong> به زبان و احساسات‌تان که ممکن است شایستگی شما را هنگام دریافت هدیه یا ستایش کاهش دهند، توجه کنید. مشخص کنید چه کسی یا چه فرهنگی به شما آموخته است که دستاوردتان را کم‌اهمیت جلوه دهید. پذیرفتن موفقیت‌تان بدون بهانه، به تدریج شناخت آن و ستایش دیگران بدون حسادت را تسهیل می‌کند.',
                'created_at'=> date('Y-m-d H:i:s'),
                'personal_profile_summary' => 'علاوه بر نتایج هر یک از ۸ فاکتور، رتبه‌بندی شما بر اساس سن‌تان و پیشنهادهای ما، در اینجا خواهید دید رتبه‌ای که بر اساس نمره کل شما در هر فاکتور تعیین شده است. تغییراتی را در مسیر جدید آگاهی کهنه‌سالی خود پرورش دهید.'
            ],
            [
                'factor' => 'Generosity',
                'language' => 'fa',
                'name'=> 'فاکتور (Ge) آگاهی بخشش (ارائه با وقار به خود و دیگران)',
                'score_label'=> 'بخشش',
                'high_score'=> '<strong>امتیاز بالا</strong> نشان می‌دهد که شما در دادن بدون انتظار متقابل لذت می‌برید. زندگی را فراوانی می‌بینید و تمایل دارید ارزش خود را با دیگران به اشتراک بگذارید. بخشش، ضدّ پریشانی و کمبود است.',
                'low_score'=> '<strong>امتیاز پایین</strong> نشان می‌دهد که شما در بخشیدن به دیگران مشکل دارید و تمایل دارید از ترس آینده ذخیره کنید. در دادن بدون انتظار بازده مشکل دارید.',
                'high_score_suggestion'=> '<strong>پیشنهادها=></strong> به توسعهٔ پذیرش اینکه شما مستحقِ فراوانی و بخشش هستید ادامه دهید. به کسانی که ارزش‌تان را درک می‌کنند، بدون انتظار چیزی در عوض، بدهید تا لذت فرایند بخشیدن در شما افزایش یابد.',
                'low_score_suggestion'=> '<strong>پیشنهادها=></strong> به زبان و احساسات‌تان که ممکن است ترس از آینده یا کمبود را در فرایند بخشیدن تقویت کند، توجه کنید. به تدریج شناسایی کنید که از چه زمانی یا از چه کسی آموخته‌اید بخشش‌تان را محدود کنید. «این برای آن» (Quid pro quo) دشمن بخشش است.',
                'created_at'=> date('Y-m-d H:i:s'),
                'personal_profile_summary' => 'علاوه بر نتایج هر یک از ۸ فاکتور، رتبه‌بندی شما بر اساس سن‌تان و پیشنهادهای ما، در اینجا خواهید دید رتبه‌ای که بر اساس نمره کل شما در هر فاکتور تعیین شده است. تغییراتی را در مسیر جدید آگاهی کهنه‌سالی خود پرورش دهید.'
            ],
            [
                'factor' => 'Admiration',
                'language' => 'fa',
                'name'=> 'فاکتور (Ad) آگاهی تحسین (شناخت ویژگی‌ها و اقدامات ستودنی در خود و دیگران)',
                'score_label'=> 'تحسین',
                'high_score'=> '<strong>امتیاز بالا</strong> نشان می‌دهد که شما توانایی شناخت خوشایند اعمال و ویژگی‌های برجسته در دیگران دارید که شایسته تقلید یا ستایش هستند. اعتمادبه‌نفس دارید که دیگران را بدون حسادت تحسین کنید.',
                'low_score'=> '<strong>امتیاز پایین</strong> نشان می‌دهد که در شناخت ارزش و ویژگی‌های برجسته دیگران دچار مشکل هستید. ممکن است میل داشته باشید موفقیت دیگران را با ایرادگیری کاهش دهید.',
                'high_score_suggestion'=> '<strong>پیشنهادها=></strong> به جست‌وجوی دلایلی برای جشن گرفتن دستاوردهای خودتان و رفتارهای ستودنی در دیگران ادامه دهید. با افراد بااستعداد و هوشمند ارتباط برقرار کنید تا از آن‌ها بیاموزید.',
                'low_score_suggestion'=> '<strong>پیشنهادها=></strong> پرورش تدریجی جشن گرفتن دستاوردهای‌تان بدون بهانه، تسهیل‌کننده شناخت آن‌ها بدون حسادت در خودتان و در دیگران است. آغاز کنید به جشن گرفتن موفقیت‌های‌تان، و به تدریج ارزش موفقیت دیگران را مثل موفقیت خودتان ببینید. کشف کنید از کی یا با چه کسی آموخته‌اید که عالی بودن‌تان را کم‌اهمیت جلوه دهید یا ویژگی‌های برجسته دیگران را نادیده بگیرید.',
                'created_at'=> date('Y-m-d H:i:s'),
                'personal_profile_summary' => 'علاوه بر نتایج هر یک از ۸ فاکتور، رتبه‌بندی شما بر اساس سن‌تان و پیشنهادهای ما، در اینجا خواهید دید رتبه‌ای که بر اساس نمره کل شما در هر فاکتور تعیین شده است. تغییراتی را در مسیر جدید آگاهی کهنه‌سالی خود پرورش دهید.'
            ],

        ];
        
        FactorExplanationConfig::insert($factorExplanations);   
    }
}




