<?php

namespace Database\Seeders;

use App\Models\Factor;
use App\Models\Question;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PersianQuestionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $labelsPersianIndexed = [
            1 => 'به نظر می‌رسد زمان سریع‌تر از وقتی که جوان‌تر بودم می‌گذرد',
            2 => 'اکثر خانواده و دوستانم قدردان آنچه من هستم، هستند',
            3 => 'به ندرت به بازنشستگی خود فکر می‌کنم',
            4 => 'همه افرادی که مرا عمیقاً آزار داده‌اند بخشیده‌ام',
            5 => 'منتظر ایجاد آینده‌ای هیجان‌انگیز برای خودم هستم',
            6 => 'ژنتیک مهم‌ترین عامل طول عمر نیست',
            7 => 'به اندازه ده سال پیش سالم هستم',
            8 => 'برایم آسان است که از حالت کار به حالت بازی تغییر کنم',
            9 => 'همیشه وقت پیدا می‌کنم که کارهای مهربانانه برای خودم انجام دهم',
            10 => 'دوست دارم مکان‌های جدید را کشف کنم',
            11 => 'افرادی که مرا می‌شناسند فکر می‌کنند جذاب هستم',
            12 => 'روزهای دوشنبه روزهای خلاقانه من هستند',
            13 => 'از بسیاری از اعضای خانواده‌ام سالم‌تر هستم',
            14 => 'در مواجهه با محدودیت‌های جسمی خود خوب عمل می‌کنم',
            15 => 'می‌توانم آینده خود را تحت تأثیر قرار دهم',
            16 => 'دیگران به من می‌گویند که جوان‌تر از سن واقعی‌ام به نظر می‌رسم',
            17 => 'دیدگاه‌های شخصی من نسبت به جهان می‌تواند بر سلامتم تأثیر بگذارد',
            18 => 'طول عمر عمدتاً تحت تأثیر ژنتیک خانواده است',
            19 => 'دوستانم فکر می‌کنند حس شوخ‌طبعی خوبی دارم',
            20 => 'در هر سنی می‌توانم دوباره عاشق شوم',
            21 => 'با کنجکاوی بیشتر از ترس با سختی‌ها مواجه می‌شوم',
            22 => 'خوش‌شانسی طبیعت من است',
            23 => 'هویت خود را بیشتر با کارم نسبت به اوقات فراغت می‌سنجیم',
            24 => 'افراد بد به دلیل ژنتیک نمی‌توانند رفتار خود را کنترل کنند',
            25 => 'زمانی که مریض هستم بیشتر به دکتر اعتماد می‌کنم تا خودم',
            26 => 'می‌توانم پس از بازنشستگی به حرفه‌های دیگر فکر کنم',
            27 => 'دوست دارم به صد سالگی برسم تا اختراعات و کشفیات جدید را ببینم',
            28 => 'اشتراک وعده‌های غذایی با خانواده و دوستان برایم بسیار مهم است',
            29 => 'وقت می‌گذارم تا از بودن در کنار خودم لذت ببرم',
            30 => 'عادات غذایی من بهتر از وقتی که جوان‌تر بودم است',
            31 => 'بهترین سال‌های زندگی‌ام در پیش است',
            32 => 'خانواده‌ام فکر می‌کنند باهوش هستم',
            33 => 'بیشتر در گذشته زندگی می‌کنم تا در حال',
            34 => 'وقتی تصمیم می‌گیرم بهترین کار را برای خود انجام دهم، نیازی به تأیید دیگران ندارم',
            35 => 'عدم قطعیت را به‌عنوان فرصت‌هایی برای شناخت خود می‌بینم',
            36 => 'هرچقدر تلاش کنم، دیگران موفقیت‌هایم را تشخیص نمی‌دهند',
            37 => 'بیشتر بدشانسی‌های زندگی به شانس بد مربوط است',
            38 => 'به طور کلی، دیگران را بیشتر از اینکه مرا دوست داشته باشند، دوست دارم',
            39 => 'بیماری‌های خانوادگی قابل اجتناب نیستند',
            40 => 'با افزایش سن، صبرم بیشتر شده است',
            41 => 'دوست دارم با افراد باهوش آشنا شوم',
            42 => 'از ترس اینکه دیگران فکر کنند به اندازه‌ای که تصور می‌کنند خوب نیستم، از اشتباه کردن اجتناب می‌کنم',
            43 => 'داوطلب شدن برای کمک به دیگران دشوار است',
            44 => 'خانواده و دوستانم فکر می‌کنند از زندگی بیش از حد انتظار دارم',
            45 => 'کنترل زندگی‌ام دست خودم است',
            46 => 'وقتی مورد انتقاد قرار می‌گیرم، خاطرات بد دوران کودکی دوباره برمی‌گردند',
            47 => 'در رها کردن خشم اکنون بیشتر از گذشته مشکل دارم',
            48 => 'وقتی دیگران به من در جمع‌ها تحسین می‌کنند، خجالت می‌کشم',
            49 => 'در حل مشکلات دیگران بهتر از خودم عمل می‌کنم',
            50 => 'خودم را دوست دارم',
            51 => 'پیری بر توانایی‌های ذهنی و جسمی من تأثیر گذاشته است',
            52 => 'گذشته‌ام اجازه نمی‌دهد از اوقات خوش زندگی لذت ببرم',
            53 => 'لذت می‌برم وقتی دیگران در جمع‌ها به من توجه می‌کنند',
            54 => 'چالش‌های زندگی را با اعتماد به خلاقیتم دنبال می‌کنم',
            55 => 'شخص خوش‌شانسی هستم',
            56 => 'از والدینم موفق‌تر هستم',
            57 => 'همان انرژی را دارم که وقتی جوان‌تر بودم داشتم',
            58 => 'در حضور غریبه‌ها راحت هستم',
            59 => 'اغلب احساس می‌کنم که به دلیل کمبود زمان باید همه چیز را سریع انجام دهم',
            60 => 'اکنون از همیشه خردمندتر هستم',
        ];

        foreach ($labelsPersianIndexed as $id => $faLabel) {
            DB::table('questions')->where('id', $id)->update([
                'label_fa' => $faLabel
            ]);
        }
    }
}
